Ran Plan for 4 projects:

1. project: `gateway-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
1. project: `gateway-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
1. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
1. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
---

### 1. project: `gateway-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecr-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecr-stage
  ```

---
### 2. project: `gateway-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecs-cluster-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecs-cluster-stage
  ```

---
### 3. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/gateway-cluster-stage/gateway-stage"
        name                               = "gateway-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for gateway-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "gateway-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "gateway"
            "Service"     = "gateway"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:6" -> "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:3"
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecs-gateway-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecs-gateway%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecs-gateway-stage
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 4. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.admin_stage will be updated in-place
~ resource "aws_cloudfront_distribution" "admin_stage" {
        id                              = "E1DT88HGE47MQT"
        tags                            = {
            "Name"         = "gateway-cloudfront-admin-stage"
            "cost_center"  = "engineering"
            "environment"  = "stage"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "gateway"
            "service_name" = "gateway"
            "team"         = "platform-team"
        }
      + web_acl_id                      = (known after apply)
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ response_headers_policy_id = "7e7f75ab-054b-430f-b525-9d7637e39b17" -> (known after apply)
            # (15 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.admin_api_cors will be created
+ resource "aws_cloudfront_response_headers_policy" "admin_api_cors" {
      + arn     = (known after apply)
      + comment = "CORS headers for Admin API responses (stage)"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-admin-api-cors-stage"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 86400
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Accept",
                  + "Authorization",
                  + "Content-Type",
                  + "Origin",
                  + "X-Requested-With",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "DELETE",
                  + "GET",
                  + "HEAD",
                  + "OPTIONS",
                  + "PATCH",
                  + "POST",
                  + "PUT",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://admin.set-of.com",
                  + "https://stage-admin.set-of.com",
                ]
            }

          + access_control_expose_headers {
              + items = [
                  + "X-New-Access-Token",
                  + "X-Trace-Id",
                ]
            }
        }
    }

  # aws_cloudfront_response_headers_policy.api_cors will be updated in-place
~ resource "aws_cloudfront_response_headers_policy" "api_cors" {
      ~ comment = "CORS headers for API responses (stage)" -> "CORS headers for Public API responses (stage)"
        id      = "7e7f75ab-054b-430f-b525-9d7637e39b17"
        name    = "gateway-api-cors-stage"
        # (2 unchanged attributes hidden)

      ~ cors_config {
            # (3 unchanged attributes hidden)

          ~ access_control_allow_origins {
              ~ items = [
                  - "https://stage-admin.set-of.com",
                    # (3 unchanged elements hidden)
                ]
            }

          + access_control_expose_headers {
              + items = [
                  + "X-New-Access-Token",
                  + "X-Trace-Id",
                ]
            }

            # (2 unchanged blocks hidden)
        }
    }

  # aws_route53_record.stage will be updated in-place
~ resource "aws_route53_record" "stage" {
        id                               = "Z104656329CL6XBYE8OIJ_stage.set-of.com_A"
        name                             = "stage.set-of.com"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "setof-commerce-leg-alb-stg-1355489929.ap-northeast-2.elb.amazonaws.com" -> "d1d43yllff7plg.cloudfront.net"
          ~ zone_id                = "ZWKZPGTI48KDX" -> "Z2FDTNDATAQYW2"
        }
    }

  # aws_wafv2_web_acl.admin_stage will be created
+ resource "aws_wafv2_web_acl" "admin_stage" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF WebACL for Stage Admin CloudFront"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "gateway-admin-waf-stage"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags                        = {
          + "Name"         = "gateway-admin-waf-stage"
          + "cost_center"  = "engineering"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }
      + tags_all                    = {
          + "Name"         = "gateway-admin-waf-stage"
          + "cost_center"  = "engineering"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "gateway"
          + "service_name" = "gateway"
          + "team"         = "platform-team"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "RateLimitRule"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-rate-limit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-common-rules"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "gateway-admin-bad-inputs"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "gateway-admin-waf"
          + sampled_requests_enabled   = true
        }
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-cloudfront-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-cloudfront-stage
  ```
Plan: 2 to add, 3 to change, 0 to destroy.

---
### Plan Summary

4 projects, 2 with changes, 2 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```